CSI API ETABS v1

# cSapModelTreeSuspendUpdateData Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int TreeSuspendUpdateData(
    	bool updateAtResume
    )

    Function TreeSuspendUpdateData (
    	updateAtResume As Boolean
    ) As Integer

    Dim instance As cSapModel
    Dim updateAtResume As Boolean
    Dim returnValue As Integer

    returnValue = instance.TreeSuspendUpdateData(updateAtResume)

    int TreeSuspendUpdateData(
    	bool updateAtResume
    )

    abstract TreeSuspendUpdateData :
            updateAtResume : bool -> int

#### Parameters

updateAtResume

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com